{"meta":{"title":"liican's zone","subtitle":"","description":"未尝与君争先后，懒得同汝共此时","author":"liican","url":"http://yoursite.com","root":"/"},"pages":[{"title":"日志","date":"2020-04-01T09:55:22.000Z","updated":"2020-04-01T10:11:16.794Z","comments":true,"path":"archives/index.html","permalink":"http://yoursite.com/archives/index.html","excerpt":"","text":""},{"title":"关于这里","date":"2020-04-01T04:47:05.000Z","updated":"2020-04-01T05:09:35.932Z","comments":true,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","text":"欢迎来到liican’s zone这里是闲来无事弄的一个blog放一些写的文字和一些玩的代码啊什么的地方 其实作为一个小白在搭建bolg啊，python啊，安装homebrew、pip什么东西的时候都花费了蛮长的时间的不过最后总算是弄好了在这里会记载一些自己探索过程中的艰辛旅程和感谢希望你也有所收获👍谢谢~ 联系我：iamliican@icloud.com"},{"title":"sitemap","date":"2020-04-01T11:53:54.000Z","updated":"2020-04-01T11:54:03.524Z","comments":true,"path":"sitemap/index.html","permalink":"http://yoursite.com/sitemap/index.html","excerpt":"","text":""},{"title":"categories","date":"2020-04-01T04:55:14.000Z","updated":"2020-04-01T05:01:48.270Z","comments":true,"path":"categories/index.html","permalink":"http://yoursite.com/categories/index.html","excerpt":"","text":""},{"title":"home","date":"2020-04-01T04:51:54.000Z","updated":"2020-04-01T04:53:54.530Z","comments":true,"path":"home/index.html","permalink":"http://yoursite.com/home/index.html","excerpt":"","text":""},{"title":"tags","date":"2020-04-01T04:54:38.000Z","updated":"2020-04-01T04:55:33.472Z","comments":true,"path":"tags/index.html","permalink":"http://yoursite.com/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"第二章 溶液热力学","slug":"第二章-溶液热力学","date":"2020-04-02T12:30:40.000Z","updated":"2020-04-02T12:32:54.633Z","comments":true,"path":"2020/04/02/第二章-溶液热力学/","link":"","permalink":"http://yoursite.com/2020/04/02/%E7%AC%AC%E4%BA%8C%E7%AB%A0-%E6%BA%B6%E6%B6%B2%E7%83%AD%E5%8A%9B%E5%AD%A6/","excerpt":"第二章 溶液热力学1 偏摩尔量及其物理性质 广度性质（容量性质）和强度性质的区别广度性质可以加和，强度性质无法加和 偏摩尔量是一个强度性质量因为在计算偏摩尔量时已经对n求导 组分的偏摩尔自由能即化学势是吉布斯自由能函数的偏摩尔量 适用于纯物质的热力学公式均适用于偏摩尔物理量","text":"第二章 溶液热力学1 偏摩尔量及其物理性质 广度性质（容量性质）和强度性质的区别广度性质可以加和，强度性质无法加和 偏摩尔量是一个强度性质量因为在计算偏摩尔量时已经对n求导 组分的偏摩尔自由能即化学势是吉布斯自由能函数的偏摩尔量 适用于纯物质的热力学公式均适用于偏摩尔物理量 (img) 不重要 溶液的吉布斯自由能 集合公式：G-D公式(img) 恒定T、P下，溶液中个组分的偏摩尔吉布斯自由能（或其他偏摩尔量）的改变是相互制约、补偿的。 2 理想溶液与稀溶液 理想溶液：在全部浓度范围内服从拉乌尔定律的溶液 拉乌尔定律：恒温条件下平衡是i组元在气相中的分压pi与溶液中i组元的摩尔分数xi成正比 理想溶液的热力学性质 理想溶液的△Hm=0，△Vm=0 稀溶液：溶质服从亨利定律，溶剂服从拉乌尔定律 (img) 物质在气相与液相中存在形态相同：i=\\[i\\]，此时满足的是西特华定律 亨利定律：溶液中i组元浓度趋近于0时，平衡后i组元在气相中的着呢起亚_pi_与溶液中i组元的摩尔含量_xi_呈线性关系 pi=Kh*xi 稀溶液的热力学性质： 混合焓和浓度无关，是常量 熵变较（△Sm(R)）有所变化 真实溶液：溶液不满足拉乌尔定律 蒸气压于浓度 真实溶液在最后一点点（接近纯物质）时符合拉乌尔定律 纯物质与假想物质标准态 活度：浓度的修正 活度系数：修正系数rB，fB(H) 对拉乌尔定律呈现真偏差的溶液组元对亨利定律一定负偏差。反之亦然。 两个标准态转换 质量百分之一溶液标准态 此状态下对应的kH值，有可能存在也可能不存在 此状态下根据亨利定律计算蒸气压： 不同标准态的转化： 习题1 思路 质量百分含量转化为摩尔百分含量（wb转化为xb）：近似的可看作$\\frac{Ma}{1}$ 三种假设情况下进行计算： 答案注意活度系数和活度的计算（要分假象情况来计算） 活度标准态的选择 小结十分重要！！！！要理解 思考题：（下节课回答） 活度的测定及计算蒸汽压法 大多数情况不能用蒸汽压求。因为饱和蒸汽压是一个很低的值，不好测 分配定律法 Lb’是浓度之比，而不是之前的活度之比。此式子将活度之比转化为了浓度之比。求不出Lb，转而求Lb‘ 如何由Lb’求Lb？ 例题 解答 why处解答：为了创造之前说的条件，使得Lp=Lp’ 例题 电动势测定法 G-D方程计算组分的活度 小结 第二个和第三个重要。题目基本上在这两个里面出","categories":[{"name":"专业课笔记","slug":"专业课笔记","permalink":"http://yoursite.com/categories/%E4%B8%93%E4%B8%9A%E8%AF%BE%E7%AC%94%E8%AE%B0/"}],"tags":[{"name":"冶金物理化学","slug":"冶金物理化学","permalink":"http://yoursite.com/tags/%E5%86%B6%E9%87%91%E7%89%A9%E7%90%86%E5%8C%96%E5%AD%A6/"},{"name":"专业课笔记","slug":"专业课笔记","permalink":"http://yoursite.com/tags/%E4%B8%93%E4%B8%9A%E8%AF%BE%E7%AC%94%E8%AE%B0/"}]},{"title":"十七","slug":"十七","date":"2020-04-02T01:21:31.000Z","updated":"2020-04-02T01:30:17.101Z","comments":true,"path":"2020/04/02/十七/","link":"","permalink":"http://yoursite.com/2020/04/02/%E5%8D%81%E4%B8%83/","excerpt":"","text":"十七 回忆总是美好的，文学的再创造则更加美好。两者合一，就是下面的东西了 1我的爷爷和我的姥爷，是性格完全不相同的两个人。一切的不一样我觉得都是因为十年动乱。那一年我爷爷二十出头，我姥爷二十五六，他们的青春被这十年占的干干净净。姥爷本来青春少年，壮志从军，想要报效国家，从老家来到兰州参军，但后来却因为家庭原因被划分为地主阶级，从军队士兵被打下来，进了改造营，还被安排去做喂猪挑大粪这种最辛苦差事；爷爷从农村出生，去到城里念书，却正值动乱时期。明显卫兵们的行为深深地震撼了他。于是在之后的日子里，爷爷告诉我面对看不惯的事情不要强行出头，在外面不要招惹事情，顾好自己就好；姥爷告诉我再苦再累都不要怕要去勇敢的面对他，要相信自己，冲冲冲。 我脑袋里同时有两个种子，分别是我爷爷的规矩、方圆和我姥爷的骄傲、不羁。很明显这两种思想无法在我身体内融洽地相处，他们没能共同创建一个和谐的精神家园。后来我才发现，他们斗争的结果是，我在达时想要独善其身，在穷时妄想兼济天下。 2我从小是跟着爷爷奶奶长大的，所以两颗种子里，是爷爷的思想先在我的小脑袋瓜里发了芽。我影响最深的事情是第一次学到“内向”和“外向”这个两个词时，我还没听老师讲他们的意思，我就觉得我属于“内向”。我规规矩矩的看书，看童话故事和寓言故事，期待着三只小猪打败大灰狼，期待着白雪公主活下来。我安安静静的看动画片，看中华小当家夸小当家做饭顶呱呱，看铁胆火车侠赞火车侠载客笑哈哈。我做足了一个听话的孩子该做的一切事情。直到有一次，我在玩玩具，爷爷奶奶在聊天。奶奶说太奶奶最近好像生病了，爷爷说那啥时候找时间上去看一下（太奶奶住在山上的村子里，所以说“上去”看一下）。奶奶说什么记不清了反正意思是最近没时间再找时间去。我一听，怒从心中来，气从胆边生，把玩具一扔，大喊一句：“你们这么不孝顺，我不认你们了！”说罢就夺门而去。爷爷在后面追着我。我跑出院子，往后一看，爷爷在身后气喘吁吁的追着我，我就觉得我这样让爷爷受累属实不应该；而且就算不认爷爷奶奶了也没必要跑出来，房子还是可以住的。这么想，我就站住了脚，跟着爷爷回家了。自从这件事情以后，我似乎觉醒了不同的属性。我在面对小朋友的时候不再无私的分享玩具：宁玩我的，我也玩宁的。我变得喜欢出门玩耍了。诸如此类。总之，姥爷的那颗种子发芽了。 3这之后我的脑子里就开始了漫长的斗争。上了幼儿园，因为我小时候比别人高半个头，宽半个身子，所以帮老师搬东西、管午休、管纪律什么的事情我都是第一人选。我有时安安静静，在班级同学面前展示一手钢琴；有时候和同学起了矛盾，在他面前展示一手拳头。我软硬并施，黑白通吃，由此占据了小红花榜榜首很长很长的时间。我是大家的好同学，老师的好学生；我是幼儿园里唯一一个敢牵着女生手大摇大摆走路的男人。 再之后上了小学，我的成绩一直优异的不得了。我和数学课代表还有正班长三分天下，我们三人在三年级前门门包揽前三。我这种情况一直持续到四年级。那一年我的数学老师推荐我去学习奥数，从那之后我的数学成绩再也没有优异过。或者说，我的所有成绩都在没有优异过。 我的正班长是个女生，个子高高的，马尾长长的，笑起来甜甜的，脸蛋要多瓜子有多瓜子。她坐在我前方不远的地方。每次做眼保健操她都会站起来巡视，我每次都通过手的缝隙偷看她。每次小测验我有不会的数学题的时候，我也会看她。她怎么啥都会啊，奋笔疾书没停过，头上的马尾随着她写字晃啊晃，鬓角的头发掉下来她会再别上去。 冯唐说男人的目光是能够滋养女人的。这是耍流氓。但男孩的目光确实是可以滋养女孩的。我看她看得越多，我的数学成绩就越差，我就越发觉得她漂亮。我相信我当时那双5.1的童子眼是有灵性的。我把我的眼镜从5.1看到了4.7。我看了她三年，默默地喜欢了她三年，充满爱意，含情脉脉；她比最美的花还要漂亮。 4但我最终没有说出口。或者说，不了了之。 上了初中，我脑袋里的我爷爷对我说，不慌。既然你数学成绩不好，那就在语文方面建树一番吧。我开始读柳永苏轼李清照，读晏殊李煜周邦彦。我计划成为一名婉约派的词人，因为这样比较容易勾搭到文艺女青年。但可惜的是，当时的我错误地估计了我国女初中生的文学造诣。新的班级里唯一的文艺女青年坐我前面，但她怎样也看不上我写出来的东西。这对于一个新生代文艺工作者来说，是极大的失败。我脑袋里的姥爷对我说，这不能忍。我每天都花心思在想要怎样才能写出个惊世骇俗的作品让她对我刮目相看。一屋不扫何以扫天下，一个班级上的文艺女青年都不认同我我又如何勾搭全国的文艺女青年。我开始读李贺韩愈温庭筠，读杜牧元稹欧阳修。体育课时我在教学楼上看她赤脚走在塑料草皮的操场上，体会卞之琳。下雨时我跟在她身后望着她撑伞走出校门口，感受戴望舒。我写满了两个笔记本和无数张找不到的活页纸。我写下的雪、月和时间足够把她的眸子和头发都染白，我写下的花、鹿和翡冷翠足够陪她走完剩下的九十多年。毕业时候我对她说，我很会写诗。尽管我看着你和那个三班男生分了七次手又和好了七次，我还是写不出任何关于爱情的东西。虽然我不会写散文随笔还有小说，但是我的文章真的写的很好。她看着我沉默了一会，对我说，其实你写的东西蛮好的；但中国文坛需要的是铁骨铮铮而不是风花雪月。以后多保重。她转身离开的时候背景赳赳。我想她就是中国文坛。而三班男生的确比我挺拔得多。 5上了高中，我脑袋里的爷爷对我说，既然你在古诗词方面的婉约派已经定型了，那不妨在散文小说上尝试着铮铮铁骨一回。我点头表示同意，于是又开始读。我读罢鲁迅胡适梁秋实，心想：原来是这么写的。我又读罢韩寒冯唐王小波，仿佛在特殊时期看了禁书：原来是要这样写？无数个课件我合起书本拿起纸笔想要与谁论战一番，但看看身边，高中同学都与我和和气气，让我无法来铮铮他一回。 在我找到我的论战对象之前，我先一步找到了对象。她不是我前桌，她是另一个班的。她的头刚好能顶住我的下巴。她笑起来比女班长还要甜，她的马尾比女班长还要高，脸蛋比女班长还要瓜子。她和当年的我一样有一双5.1的充满灵性的童子眼。她的成绩和当年的我一样好。 我和她坐在校园的石椅上。昏暗的路灯就伫立在我俩旁边，但我俩都丝毫不以为他是外人。我向她讲述了我前17年所有想到的东西和决定的东西，她安静的听我说着讲着并报以微笑。我对她说，我会写诗。她吟吟一笑，那你怎么没给我写过情诗。我说你别笑，我真的会写诗。我写满了两个笔记本。我写过的雪和月能把整个校园染白，我写过的花和鹿能从现在陪我们直到老死。我真的会写诗。她收住笑，双手拢住我的脖子，在我耳边呼气如兰：我知道，我都信。我第一次见你时候你在给别人说你的小说。我站得很远，你肯定没看见我。你虽然戴着眼镜，但我还是能看见你的眼睛里闪着光。金灿灿的，有夕阳和朝霞撒在里面。就和刚刚一样。你的眼仁和瞳里藏着东西，我想看到他们….我不等她说完，接过她的脸，狠狠吻在她的眼睛上。 6在我以为我要独善其身的时候，我和她分开了。这段持续15天的恋情结束了。之后她找了个比我瘦，比我白，没我高，比我有钱，长得比我更像文艺青年的男生。我脑袋里的爷爷对我说，你还年轻，失去的没有必要过分挽留了。我说，你说的对。我想了想，我的数学很差，比一般人的平均水平还要低。我说不出写文章钱钟书第一李渔第二我第三这种话，我连李渔是谁都不知道。我盯着三个门洞十年也写不出《三重门》。我七岁时候诗都没读过几首更别提写诗。我也不可能一路学霸考MBA成为麦肯锡全球合伙人。但我也渐渐知道，不会做题就得去问同学，盯着女同学的马尾是出不来答案的。我写文章不那么好但也让人哭过笑过，如此即是很大的安慰。在厕所门口犹豫的时间里我还能写出《两间房》《两条路》和《论女权》三篇文字。七岁写不出《鹅》我也能在二十七岁写点情诗。我也不知道什么是生活什么是生命，但我活着大概就是活这一条道。 7后来我写了很多诗。我写我遇见到的姑娘和没遇见过的姑娘。我用顾城写她，我用海子写她，我吻过黑夜给她的眼睛，我看过她身上的亚洲铜。但我始终写不出小说。 我的脑袋里的姥爷看着我笑了。他递给我一个电话，我拨给一个姑娘。电话通了，她不出声。我说，奉贤风大她不说话我说，你不说话的话那我也不说话她挂了 东边的孔雀收屏了，南边的熊猫下崽了我听见她哭了可树静静地生长着 —————————————————————————————————2019.12.16翻电脑时候突然翻到了这一篇。这是我高考之前写给语文老师想要证明自己的一篇作文hhhhh然后李洁给我的稿纸上画满了波浪线。我知道她可能是习惯使然但我看着贼难受我就再没去找过她了 当时我想的是记录一下高二之前的17年都发生了什么羡慕当年的我还有如此的心气。现在只会阴阳怪气了。 现在的我又看了看周围，发现只有似乎只有我还在沉浸在以前的事情里刚上大学的时候和以前的朋友出去玩。吃完饭讨论饭后活动，我说要不去网吧？被嫌弃：柴师傅，只有高中生才去网吧呀最近又在和以前的朋友闲聊，被嫌弃：柴师傅，只有大学生才干这个呀做人好难 心里话在日志里是不会说的但如果是以前的心里话应该是可以的👍 初中部分是借题发挥高中部分是纯粹胡扯如果冒犯到了宁，我诚挚地道歉 图一乐嗷，图一乐","categories":[{"name":"随笔","slug":"随笔","permalink":"http://yoursite.com/categories/%E9%9A%8F%E7%AC%94/"}],"tags":[{"name":"随笔","slug":"随笔","permalink":"http://yoursite.com/tags/%E9%9A%8F%E7%AC%94/"}]},{"title":"Endnote的使用简述","slug":"Endnote的使用简述","date":"2020-04-01T14:13:49.000Z","updated":"2020-04-01T15:57:03.143Z","comments":true,"path":"2020/04/01/Endnote的使用简述/","link":"","permalink":"http://yoursite.com/2020/04/01/Endnote%E7%9A%84%E4%BD%BF%E7%94%A8%E7%AE%80%E8%BF%B0/","excerpt":"endnote简介ennnote是一款十分出色的文献管理工具。在我的本科毕业论文写作过程中endnote给予了我十分巨大的帮助，在文献管理方面节约了我许多时间。因此今天在这里把这款软件介绍给大家，希望对大家有所帮助。","text":"endnote简介ennnote是一款十分出色的文献管理工具。在我的本科毕业论文写作过程中endnote给予了我十分巨大的帮助，在文献管理方面节约了我许多时间。因此今天在这里把这款软件介绍给大家，希望对大家有所帮助。 endnote下载这里是Endnote的官网地址：Endnote官网地址我们可以看到Endnote的定价比起Adobe要稍稍实惠一点。下载软件的方法请各位自行解决。实在找不到的也可以联系我。联系方式在“关于我”页面内有。 endnote的使用 因为我是macOS系统，所以这里以macOS系统演示。实际上Endnote在win和mac上差不多，因为我也是看着win版教程学会的hhh本文设计的应用部分主要以笔者写本科论文的实践经验为主，意在交流。对于其他类的写作任务原理相通，请各位自行找到最适合的方法。 建立自己的文献库进入endnote界面以后呢先新建一个library。Endnote离得library可以理解为类似imovie的素材库。library里存放着你搜集的文献，对于一类课题，可以把相关的文献全部导入进一个library内。 1在菜单栏内点击File → New即可新建一个library 导入文献导入文献是十分重要的一步。导入文献的方法有很多。在这里我使用Endnote的方法不是阅读，而主要是插入参考文献，因此导入时一定要导入文献信息。接下来来详细说明。 通过PDF导入12file → import点击左下角的options，出现下面的界面 1234这里是导入的选项在第一个内选择“pdf”即可导入pdf文件第二个选择“sidcard duplicates”这样导入时不会重复导入。对批量导入十分重要第三个是翻译。我没试过。我不太相信它的翻译质量hhh 导入后即可在界面内看到你导入的文献。点击文献可以在右边阅读。 十分不推荐用PDF导入！！！ 我们使用Endnote的主要目的是插入参考文献而不是阅读。直接通过PDF导入的中文文献Endnote无法获取它的信息，导致无法插入只能阅读，十分尴尬。英文文献有一些可以获取信息，有一些也会出现无法获取的情况。而且导入太多PDF会导致Endnote速度变慢。所以十分不推荐这种方法。 通过知网导入（适合中文文献）这是我最常用的方法之一。在浏览知网时，找到你想要的文献，然后在标题前的方框内打勾当你找好一些文献的时候，在搜索页面点击“导出/参考文献”在之后的页面的左栏点击“Endnote”，再点导出这样你的浏览器会下载一个纯文本文件。这就是从知网导入的文献信息文件。我们再打开Endnote，点击file → import，在options里选择“Endnote Import”（如图）这样就可以导入文献信息。你会发现这样导入的文献只是信息，是无法阅读的。你也可以在之后把文献信息手动链接到PDF文件，这样可以阅读，但是这样比较繁琐。我还是习惯在PDF阅读器里阅读，然后通过Endnote导入参考文献。对于这样一套流程来说，文献信息足矣。 通过bing学术/谷歌学术导入（适合英文文献） 这里以bing学术作为示范 在bing学术界面内搜索论文。一般的英文论文在搜索页面就会出现“引用”和“批量引用”的按钮。点击“批量引用”（除非你确定你只引用一个），右边的蓝色小方块上会出现“1”，点击蓝色方块，在右上角选择“导出至 → Endnote”这时你的浏览器会下载一个enw文件。双击可以直接打开这个文件，Endnote会让你选择导入到哪个library内。选择好后即导入成功。 导入的也是文献信息，非文献内容。 通过网站导入我们以science direct举例这是SD上随便打开的文献，在明显的位置就有export。点击后发现没有Endnote其实其中的RIS格式就适用与Endnote。选择export to RIS，浏览器会下载一个ris文件，一样的，直接打开，导入至library内就好。其他一些网站方法和这个类似，找到导出按钮就好。值得说的是SD的搜索页面也可以和知网一样，打勾，批量导出。 Endnote内部搜索导入在Endnote内部点击上方地球一样的图标可以进入线上库。左边有线上搜索的选项由于网速问题我没有体验过这样导入orz 导出参考文献（配合word使用） 不会真的有人用wps写论文吧（不是 修改参考文献格式 这一步当时困扰了我好久好久。现在整理给大家 不知道有没有同学和以前的我一样，以为参考文献格式是世界通用的其实不是嗷。我们国家通用的参考文献格式叫做GB/T7714，而Endnote作为一款国外软件自然是不会默认为这个格式的。这就需要我们去修改一下，让Endnote按照GB/T7714格式导出参考文献。 首先要去Endnote的官网下载合适的格式（网速很慢请等等嗷） https://endnote.com/downloads/styles/在网页内搜索chinese，找到GB/T7714这个格式，下载 网速不好的同学可以使用下方的国内镜像下载（雾 https://pan.baidu.com/s/1GECj3YzIfstu9q-7odRSiQ 密码:gdzk 下载完成后把下载好的文件放入Endnote文件夹内的style文件夹内打开Endnote 12菜单栏点击edit → output styles → open styles manager选择刚刚导入的GB&#x2F;T7714格式（我重命名了，文件名应该叫chinese） 这样就修改好了导出的格式 在word内应用打开你的word，你应该惊喜的发现最上面的选项卡多了一个在style内选择chinese，然后把光标移动到你想插入文献的地方，按“insert ciation”，找到你想插入的文献，即可成功插入。通过Endnote插入的文献十分智能。在你插入完毕后，如果调整文字顺序导致文献顺序错乱，他会自动更新顺序。在文字内删除插入角标也会在最后删除文献信息。在同一个光标出连续插入文献也会自动整合。可以说是十分智能了。在此选项卡内还有一些别的设置参考文献格式的内容，比较简单，这里不再赘述。 总结Endnote是一款非常非常好用的文献管理神器。在我写毕业论文的过程中它帮助我节省了大量时间，对我帮助十分大。希望你也能学会使用它，让Endnote帮助你爱上写毕设👍加油！","categories":[{"name":"macOS配置/软件操作指南","slug":"macOS配置-软件操作指南","permalink":"http://yoursite.com/categories/macOS%E9%85%8D%E7%BD%AE-%E8%BD%AF%E4%BB%B6%E6%93%8D%E4%BD%9C%E6%8C%87%E5%8D%97/"}],"tags":[{"name":"macos","slug":"macos","permalink":"http://yoursite.com/tags/macos/"},{"name":"win","slug":"win","permalink":"http://yoursite.com/tags/win/"},{"name":"endnote","slug":"endnote","permalink":"http://yoursite.com/tags/endnote/"}]},{"title":"第四章 相图","slug":"第四章-相图","date":"2020-04-01T03:34:09.000Z","updated":"2020-04-01T05:06:23.681Z","comments":true,"path":"2020/04/01/第四章-相图/","link":"","permalink":"http://yoursite.com/2020/04/01/%E7%AC%AC%E5%9B%9B%E7%AB%A0-%E7%9B%B8%E5%9B%BE/","excerpt":"第四章 相图 学校课程笔记冶金物理化学 第四章","text":"第四章 相图 学校课程笔记冶金物理化学 第四章 1. 相律 f、C、r的计算 有几个例子。看书 几个典型二元相图2. 相图基础知识 2.1. 二元相图的知识 AB相只在竖直的直线上生成——包晶反应 5:A+AB 6:B+AB 沿着R1线:c1发生包晶反应，A+L→AB 沿着R2线:c2处发生包晶反应，A+L→AB 沿着R3线:从c3到d3点。d3点共晶反应，L→B+AB（一个液相生成两个固相） 3 三元相图的绘制与读解3.1. 基本知识 表示方法 立体相图 平面投影图 等温截面图 三元凝聚态体系自由度：f = C-φ+1 = 4-φ(忽略压强影响） 三元平衡态的平衡状态决定于温度和两个组元温度 要完整的表示三元系的状态，必须采用三维空间图形 在立体图中，底面上三角形表示体系组成，垂直于底面的座标表示温度 3.2. 典型三元相图举例 简单三元相图 具有一个三元同分熔点化合物的三元相图 具有一个二元异分熔点化合物 3.3. 基本知识1. 浓度三角形 三顶点：表示体系纯组分 三条边：分别为三个二元系 2. 三元内任一组成确定 垂线长度法 过O对三边垂线，长度代表其指向角的浓度 三根垂线总和为高，记为浓度百分百 平行线法 做三边平行线，在边上从顶角所截线段之长分别代表对应角浓度。 记三角形边长长度为100% 3. 浓度三角形的性质 等含量规则- ![](https://i.loli.net/2020/04/01/i6WmY18aoesctjI.png) 等比例规则 背向原则 杠杆规则 直线规则 重心规则 交叉位规则 共轭位规则 3.4 三元系相图表示方法1.立体相图 1.1. 三元系的构成 1.2. 三元立体图中面、线、点的意义1.2.1. 液相面 1.2.2. 相界线（共晶线) f为1——温度 1.2.3. 无变量点 总结：三元系相图中的自由度和相数 2.平面投影图 内界线和侧界线 3.等温截面图3.5 三元相图解读要点3.5.1. 化合物 3.5.2.区域 标识初晶区的方法 就近原则：对于某一初晶区，初晶物质不会远离初晶区，或在初晶区内，或在紧邻的初晶区内。 属性判断原则： 线条：所有线都是二元共晶线或二元包晶线 点：三元共晶或包晶点 等温线： 特殊： 3.5.3.几条重要规则1. 温度最高规则 2.切线规则（判断相界限规则） 箭头标柱的是温度方向 3. 重心规则 4.判断无量变点的另一种方法 单转熔：两外一里 双转熔：两里一外 5.三角形规则 3.5.4. 冷却过程分析 冷却分析实例 g点发生二元共晶反应，g→e过程中只有B,C生成。到达e点以后才有A生成 液相点、固相点、共熔点总在一条直线上 3.5.5.杠杆原理的应用 3.5.6 小结 3.6 几个特殊3.6.2 具有一个稳定二元化合物的三元相图 3.6.2 一个不稳定二元化合物的三元相图 P2’P这里是包晶反应。由切线规则判定反应物质方向 等温截面图 三元相图小结 这个是重点，必考 相图在生产中应用","categories":[{"name":"专业课笔记","slug":"专业课笔记","permalink":"http://yoursite.com/categories/%E4%B8%93%E4%B8%9A%E8%AF%BE%E7%AC%94%E8%AE%B0/"}],"tags":[{"name":"冶金物理化学","slug":"冶金物理化学","permalink":"http://yoursite.com/tags/%E5%86%B6%E9%87%91%E7%89%A9%E7%90%86%E5%8C%96%E5%AD%A6/"},{"name":"专业课笔记","slug":"专业课笔记","permalink":"http://yoursite.com/tags/%E4%B8%93%E4%B8%9A%E8%AF%BE%E7%AC%94%E8%AE%B0/"}]},{"title":"吴荆子破灭记","slug":"吴荆子破灭记","date":"2020-03-31T17:06:18.000Z","updated":"2020-04-01T05:06:11.358Z","comments":true,"path":"2020/04/01/吴荆子破灭记/","link":"","permalink":"http://yoursite.com/2020/04/01/%E5%90%B4%E8%8D%86%E5%AD%90%E7%A0%B4%E7%81%AD%E8%AE%B0/","excerpt":"吴荆子破灭记 写在前面本来写下来的题目叫做“执念破灭的全记录”。但老实说，有点下不去笔。我的心里似乎没有那么多的垂头与丧气可以与大家分享——几秒前的自己又回到了“为赋新词强做愁”的地步。想了想，把标题改成了现在这个。这个标题比起之前的一个，似乎更没有意义，可我却觉得一下子手腕流畅了许多。最近听了许多遍《人在江湖》，想必这就是讲段子要搬出王老爷子的真正道理：不是让观众觉得亲切，而是让创作者拥有无限创作的动力。噢，原来是如此如此，这般这般。想通这件事的一瞬间，我的脑袋上照来了一束光，把我的油头照的锃光瓦亮。本文改编地极其夸张，已严重偏离事实，请不要对号入座我藏了许多彩蛋，看不懂或者猜到的部分欢迎私聊本文共5050字，篇幅稍长，请酌情翻阅","text":"吴荆子破灭记 写在前面本来写下来的题目叫做“执念破灭的全记录”。但老实说，有点下不去笔。我的心里似乎没有那么多的垂头与丧气可以与大家分享——几秒前的自己又回到了“为赋新词强做愁”的地步。想了想，把标题改成了现在这个。这个标题比起之前的一个，似乎更没有意义，可我却觉得一下子手腕流畅了许多。最近听了许多遍《人在江湖》，想必这就是讲段子要搬出王老爷子的真正道理：不是让观众觉得亲切，而是让创作者拥有无限创作的动力。噢，原来是如此如此，这般这般。想通这件事的一瞬间，我的脑袋上照来了一束光，把我的油头照的锃光瓦亮。本文改编地极其夸张，已严重偏离事实，请不要对号入座我藏了许多彩蛋，看不懂或者猜到的部分欢迎私聊本文共5050字，篇幅稍长，请酌情翻阅 1我喜欢以一个没有感情的第一人称来讲故事。这大概是我在青春期时候迷恋某日本作家给我造成的习惯。这个作家的大多数小说都让我感觉主角是一个“社会性孤儿”。这样一个人，他没有父母，在极少数的情况下有妻子，大多情况下是一个喜欢手冲或者人妻的有志青年。的确，这样的主角少了许多不需要的表达，所以所有的句子都指向这个人最矛盾的地方。他做的事充满逻辑但又冷冰冰；遇到艳遇和丢失雨伞时候的心情是一样的，描写胴体和描写大象的感觉是一样的。 每当他去冲或撞击的时候，他描写这件事的感觉和描写每天清晨喝一杯热水的感觉是一样的——是举手之劳的事情，虽对身体不错，却也不是每日必做之事。这样的主角真的是充满魅力啊。想到这里又不禁发问：这到底是作者的问题还是林少华的问题？不得而知。唯一知道这个问题答案的办法是，去学日语然后读那个作家的原著。想到这又觉得这件事情似乎不值得我去学日语，于是放弃了探索这个问题答案的欲望。一个完美的思维闭环产生了，我心安理得地继续做其他的事情。这就是这么久以来作为“我”的行为模式——对我来说，唯有进入“我”的情景中，才能写得出来像样的故事。 2我第一次拄拐是在我15岁时候。学校篮球场的地上有一个小凹陷，我一不小心被这凹陷使了绊子，崴了脚。伤势倒不是很严重——轻微一点骨裂加软组织挫伤——却也不轻。我需要静养一段日子。俗话说伤筋动骨一百天。事实证明这句话没毛病，我确实过了三个月才能用自己的腿走路。拄拐在当时应该算是稀奇事。小孩嘛，没见过身边的人拄拐。我每天上教学楼都要引来一阵阵的侧目；但也不是什么讨人厌的眼光。首先，一阶一阶跳着上楼的我确实阻塞了交通；其次，那眼光也只是好奇的眼光而已。我爸每天扶着我蹦跶着上四楼。我每天单腿蹦台阶累得够呛，我爸倒很享受送我上学接我放学的过程：因为他走在学校里时候总有人叫他老师，这让他感到极大的舒服。我爸和我是一样的，他发现了我撒的谎，他不说；我发现他看hs网站，我也不说。我们爷俩靠着默契走到了今天。就好像我妈安排我远方表哥接送我上学，但我坚持“不懂事”要我爸接送。我想我爸应该是开心的。 3在我拄拐的日子里，期中考试到了。我继续迈着蹒跚的步（拐）子，走进了期中考试的考场。我们的考场是按着成绩排的，也就是说，能在一个考场的人都是成绩差不多的，所以我多多少少对同一个考场的人都有些亲切感。我拄着拐走向我的座位。还好，靠窗，我能把我的拐靠着暖气片，让他有个依靠。在我走向座位的时候，坐在我后面的同学伸手帮我接过了拐，扶了我一下让我坐好——这个人就是吴荆子。我道声谢谢，算是第一次打的招呼。他和他旁边的小伙伴在侃大山，好不热闹。我行动不便，没法去找我的小伙伴侃大山；而一个考场的我的小伙伴也没有一个过来找我。我在默默伤心之余强行加入了他们的聊天。吴荆子戴着酷炫的黑框眼镜，留着层次分明的斜刘海，长着几个小小的、跃然纸上的小粉刺。他坐着的时候还比我矮一点，但站起来却比我高了不少。从小到大这种情况在我身边发生过许多次，我已然了解。我和吴荆子聊得看起来虎虎生风，但实际上尴尴尬尬。但男生的尴尬是虚假的尴尬——他们只是没有找到那一个共同的兴趣。我说，你的儒林外史写的很好。他说，快乐的羽毛扫是禁卡（指向我的拐）。我说，你恋爱了吗，祝你早生贵子。他说，名字越小，能力越大，我没任何毛病。我们掉了对方许久的鱼，但始终对不到一个点上。我心里暗忖：此人涉猎之广不亚于我，实属不一般，颇有相见恨晚之意。他说，你居然知道此字读cǔn，兄弟，你有点东西。 4那次考试以后我和吴荆子混了个脸熟，但也没有再多地联系。我惊讶的是他居然是sir班的。在我的印象里sir班男生基本上都是笑面虎——用现在的话说叫大阴阳家。我回忆起他的眼镜、刘海和粉刺，这三样东西在我脑子里变成了八卦的模样。吴荆子对我说，他那不是阴阳怪气，他正常说话就这样。我说，你不是阴阳人，就是老色批。他说，我都不是。我就是一个普通的文艺青年。那个时候文艺青年这个词还不是骂人的。我说，真的吗？我不信。 我找到我认识的另一个sir班的男生。我问碌为菁，吴荆子是阴阳人吗。碌为菁摇摇头说，我认识的人里面，只有你们班的人是阴阳人。我又问他，那吴荆子是色p吗。碌为菁摇摇头，我认识的人里面，只有应宏是色p。我抿了抿嘴唇，说不出一句话来。他说，你不能因为你是这样，就觉得他也是这样。我抿了抿嘴，边说着“我的我的”，边朝楼上走去。 5我渐渐发现，吴荆子文采不输于我，而他欣赏女生的眼光却高于我。这两样当年的我最看重的东西一件打成平手一件彻底落败，我的心里很不是滋味。我和他走在放学路上，旁边过去了四五个女生，吵吵闹闹。正在和他谈笑风生的我不禁皱了皱眉头。等她们走过去，吴荆子往后看了看，默默地点了点头。我说，你又在看姑娘了，你为什么不能和兄弟我好好聊聊天呢。吴荆子说，对不起，她的眼睛实在是太美了。我说，谁啊，谁啊。他说，劳贝罗班的班花啊，你不知道吗。我说，关于他们班的班花是谁这个问题我听过五个版本的答案，我哪知道是谁。吴荆子摇摇头，你啊，你要用自己的眼光去发现，不能听别人说谁就是谁啊。我说你说的有道理，那你能告诉我到底是谁吗。他说，等到中国登上月球的时候我就告诉你。我说神舟五号都成功飞了，这一天不远了。他说，嗯，确实是挺近的了。 6元旦晚会时候每个班排成一溜坐着。我个子再当时还算比较高，加上我担任班长，所以站在最后面负责维持班级后半部分的纪律。碌为菁和吴荆子比我还高，所以他俩也在他们班级的最后。演出开始不久，一个同学在台上完美演绎了一首《杀手》。歌声刚完，吴荆子走到了我旁边站着。我说，一人二字，第三节目，练熟四功五法六角，唱出了七八九似，十分好听。他说，十拿九稳，共八女子，聊过七天六夜五晚，只剩下四氧三铁，一个直男。我说，好工整啊。他说，你啊，你来的正好。我跟你打听个人。我问是谁，他眼神指向了我们班一位普通女子。我问，你也想结婚了吗。他摇摇头，并不是，那不是我的结婚对象。那是我理想的419对象。我说，我没有看错你，你果然是老色p。他摇摇头说，看到白胳膊，立即想到大腿；听到口嗨，立马想到我是色p。这么看来，你才是真正的色p。我说，那你给我翻译翻译，什么叫419。他说，419 = fool one knight，意思是我想像愚弄一位骑士一样，稍微愚弄一下那位女士。我情不自禁的拍手叫好，同时反省自己为什么没有好好学英语。就在我们讨论英语的时候，一个眼睛已经悄悄地盯上了吴荆子。我们班一个女生在我考完期中考试以后就向我打听吴荆子的消息，但我没有在意。隔着两个班难道还能在一起不成。事实证明我错误估计了我国青少年的恋爱意愿。在元旦过后，他就和那个女生结婚了。 7结了婚之后吴荆子的地位一路上升，他从我耳朵里的“吴荆子”慢慢变成了“吴哥”。过去的历史告诉我，当你的男性朋友结婚之后，他会选择一位友人来倾诉他感情中的事情，其余人就会变得少有交集。之前的俊哥选择了我，而吴荆子选择了同班的碌为菁作为这一位有人。我虽然触及不到他的感情，但他的感情却无时无刻不在我身边——这个课间结束，那个女生开开心心地从楼下跑上来，满脸笑意收不住：这是腻着呢；下个课间，那个女生周围围了一圈女生在安慰，泣不成声欲哭无泪：这是吵架了。我身边好像放了一个专门显示吴荆子感情近况的阴晴表。我和他成了最熟悉的陌生人。 根据阴晴表推测，碌为菁一个人怕是承受不了这么高强度的感情宣泄。于是我成为了他的倾诉对象。他说，他实在是和吴荆子待不下去，他眼里入不了那些东西。他说，他实在不愿意呆在班里，每天都有一声卓尔游侠从门口喊过来。白天，我收到了吴荆子感情的阴晴信号；放学，我从碌为菁那里听到精华版的故事，再和他一起讨论。我站在一个无比奇怪的角度目睹了这一场婚姻。 有一个不得不承认的事情是，女性的的确确能大大激发一个男性的创作能力。吴荆子结婚之后便开始了高强度的情书创作。每天上课拿出一张纸，开头写下亲昵的称呼，洋洋洒洒四十分钟，结尾落下一个帅气的签名。常在河边走，哪能不湿鞋；何况吴荆子不是在走，是在河边跑。吴荆子常常被老师抓住在课上写情书，但越是这样越能激发他的创作灵感。如同在壶口瀑布边仰泳，如同在开镜时看到铁拳；肾上腺素飙升带来的是疯狂的灵感。他没有选择和以往一样与我分享文章，共同进步。我明白我们再也不会有流觞曲水探讨文学的景象了（虽然也从未有过）。他俩写的东西都装在一个黑色的文件夹里，那个厚厚的文件夹的颜色和加了浓硫酸的蔗糖一样黑。那里面掺着甜和酸，释放着酸臭，还有他们视为珍宝的、不可告人的秘密。 8我不知道他是不是快乐的，当时的他和现在的他也许有不同的看法。但我和碌为菁的看法是一致的，我俩都不快乐。时间很快渡过了那年暑假，来到了毕业的时候。我不知道毕业之后的吴荆子和她又发生了啥故事；我只记得毕业那天吴荆子还靠着她坐在操场的长椅上。吴荆子还是和往常一样和我谈笑风生，可他不再和我交流文学和游戏了（他和碌为菁交流）。他的眼睛里是他俩的吴青峰和郭敬明。俊哥早就知道，异地恋是没有好结果的。这个道理与人说不得，只能自己去悟。毕业之后吴荆子和她也异地了，而且异得很远很远。吴荆子和碌为菁去了一所学校，我去了另外一个。我和他俩的联系愈来愈少，他俩消息我也知道的愈来越少。我听说吴荆子和她分开了，之后的消息就是断断续续的，什么倪倪，家凝，版本众多，无一真实。我与碌为菁有时还能一起去一趟黑网吧，可吴荆子我是再也没有见到过了。 9再见到吴荆子是我大学了。在一次饭局上我又见到了吴荆子。酒过三巡，吴荆子对我说，兄弟，恋爱没有那么美好。我说，恋爱本身没有问题，是你俩有问题。吴荆子说，兄弟，你不懂。我说我懂，爱情就好像早晨的一个田园脆鸡堡，就好像年轻时私奔的幼稚诺言，就好像单纯的炽热的约定，就好像……我还没说完，他挥手打断我，然后说，兄弟，你没经历过，你真的不懂。我抿了抿嘴，说不出话。吴荆子说，你应该看过，有一本书叫荆棘鸟。我点头。他继续说，我感觉我的爱情就和书里面一样，神父是不配拥有爱情的。我说，你不要给自己营造悲惨人设了，你没有那么大的家族纠葛，你也没有在信仰和爱情里面作斗争。你要是个和尚你还能说一说，你现在你装尼玛呢。他说，你不懂，我就是荆棘鸟。我说好好好，我不懂，你是你是。他又说，不对，我名字里有个“无荆”，我不能说我是荆棘鸟。我说，那你是啥，都听你的。他说，既然无荆，只剩鸟了。我说你别自己骂自己，你不是鸟。他嘴里嚷嚷着“我就是，爷就是”，就倒过去了。 那天之后至今我也再没有和吴荆子见过面，甚至没有发过消息。我关注他的方式就是看他的微博，或者是碌为菁转给我的他俩的聊天记录。他在看着我看不懂的漫画，听着我不知道的歌，应援我不知道的明星，说着我听不懂的行业内部黑话。唯一能看懂的是他转了一条苏打绿的微博，配文道：“我的青春回来了”。 10天下大势，分久必合，合久必分。吴荆子的这片天下分了五次，合了四次——这是碌为菁给我掰着手指头数的。我和碌为菁在一起常常讨论着兄弟们的感情史，这是他的快乐源泉，这是我的灵感瀑布。这个源泉和瀑布底下都藏着没有说完的话和没有结局的故事。我有时候会想，世界上这么多的人，又有多少个这样的故事。我也会想，吴荆子的人生如果没有这个女人会变成怎样呢。但到头来，这种问题没有一点点意义。只有记者、老师和面试官才会问类似这样的“终极性的问题”。每个人来到这里走这一遭，遇到的人和事情都是你路上注定的东西。这些东西组合在一起就是现在的你和现在的我。我回过头去看了看最开头我写的那番话。我写的真的是吴荆子破灭的记录吗？他可能活的比大多数人都辛苦，也比大多数人都舒服。 柳2020.3.601:07西固家中","categories":[{"name":"随笔","slug":"随笔","permalink":"http://yoursite.com/categories/%E9%9A%8F%E7%AC%94/"}],"tags":[{"name":"随笔","slug":"随笔","permalink":"http://yoursite.com/tags/%E9%9A%8F%E7%AC%94/"}]},{"title":"helloworld","slug":"helloworld","date":"2020-03-31T16:56:53.000Z","updated":"2020-03-31T16:57:12.378Z","comments":true,"path":"2020/04/01/helloworld/","link":"","permalink":"http://yoursite.com/2020/04/01/helloworld/","excerpt":"","text":"helloworld","categories":[],"tags":[{"name":"code","slug":"code","permalink":"http://yoursite.com/tags/code/"}]}],"categories":[{"name":"专业课笔记","slug":"专业课笔记","permalink":"http://yoursite.com/categories/%E4%B8%93%E4%B8%9A%E8%AF%BE%E7%AC%94%E8%AE%B0/"},{"name":"随笔","slug":"随笔","permalink":"http://yoursite.com/categories/%E9%9A%8F%E7%AC%94/"},{"name":"macOS配置/软件操作指南","slug":"macOS配置-软件操作指南","permalink":"http://yoursite.com/categories/macOS%E9%85%8D%E7%BD%AE-%E8%BD%AF%E4%BB%B6%E6%93%8D%E4%BD%9C%E6%8C%87%E5%8D%97/"}],"tags":[{"name":"冶金物理化学","slug":"冶金物理化学","permalink":"http://yoursite.com/tags/%E5%86%B6%E9%87%91%E7%89%A9%E7%90%86%E5%8C%96%E5%AD%A6/"},{"name":"专业课笔记","slug":"专业课笔记","permalink":"http://yoursite.com/tags/%E4%B8%93%E4%B8%9A%E8%AF%BE%E7%AC%94%E8%AE%B0/"},{"name":"随笔","slug":"随笔","permalink":"http://yoursite.com/tags/%E9%9A%8F%E7%AC%94/"},{"name":"macos","slug":"macos","permalink":"http://yoursite.com/tags/macos/"},{"name":"win","slug":"win","permalink":"http://yoursite.com/tags/win/"},{"name":"endnote","slug":"endnote","permalink":"http://yoursite.com/tags/endnote/"},{"name":"code","slug":"code","permalink":"http://yoursite.com/tags/code/"}]}